tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf27j53_tdd.h
#define UPP0                          522
#define PPB0                          523
#define UPP1                          524
#define PPB1                          525
#define FSEN                          526
#define UTRDIS                        527
#define UPUEN                         528
#define UOEMON                        529
#define UTEYE                         530
#define RTCVALL                       531
#define WAITE0                        532
#define RTCVALH                       533
#define WAITE1                        534
#define WAITM0                        535
#define WAITM1                        536
#define WAITM2                        537
#define WAITM3                        538
#define WAITB0                        539
#define WAITB1                        540
#define PADCFG1                       541
#define RTSECSEL0                     542
#define RTSECSEL1                     543
#define REFOCON                       544
#define RODIV0                        545
#define RODIV                         546
#define RODIV1                        547
#define RODIV2                        548
#define RODIV3                        549
#define ROSEL                         550
#define ROSSLP                        551
#define ROON                          552
#define RTCCAL                        553
#define CAL0                          554
#define CAL                           555
#define CAL1                          556
#define CAL2                          557
#define CAL3                          558
#define CAL4                          559
#define CAL5                          560
#define CAL6                          561
#define CAL7                          562
#define RTCCFG                        563
#define RTCPTR0                       564
#define RTCPTR1                       565
#define RTCOE                         566
#define HALFSEC                       567
#define RTCSYNC                       568
#define RTCWREN                       569
#define RTCEN                         570
#define ODCON3                        571
#define SPI1OD                        572
#define SPI2OD                        573
#define ODCON2                        574
#define U1OD                          575
#define U2OD                          576
#define CCP9OD                        577
#define CCP10OD                       578
#define ODCON1                        579
#define ECCP1OD                       580
#define ECCP2OD                       581
#define ECCP3OD                       582
#define CCP4OD                        583
#define CCP5OD                        584
#define CCP6OD                        585
#define CCP7OD                        586
#define CCP8OD                        587
#define ALRMVALL                      588
#define ALRMVALH                      589
#define ALRMRPT                       590
#define ARPT0                         591
#define ARPT                          592
#define ARPT1                         593
#define ARPT2                         594
#define ARPT3                         595
#define ARPT4                         596
#define ARPT5                         597
#define ARPT6                         598
#define ARPT7                         599
#define ALRMCFG                       600
#define ALRMPTR                       601
#define ALRMPTR0                      602
#define ALRMPTR1                      603
#define AMASK0                        604
#define AMASK                         605
#define AMASK1                        606
#define AMASK2                        607
#define AMASK3                        608
#define CHIME                         609
#define ALRMEN                        610
#define ANCON0                        611
#define PCFG0                         612
#define PCFG1                         613
#define PCFG2                         614
#define PCFG3                         615
#define PCFG4                         616
#define ANCON1                        617
#define PCFG8                         618
#define PCFG9                         619
#define PCFG10                        620
#define PCFG11                        621
#define PCFG12                        622
#define PCFG15                        623
#define VBGEN                         624
#define DSWAKEL                       625
#define DSPOR                         626
#define DSMCLR                        627
#define DSRTC                         628
#define DSWDT                         629
#define DSULP                         630
#define DSFLT                         631
#define DSWAKEH                       632
#define DSINT0                        633
#define DSCONL                        634
#define RELEASE                       635
#define DSBOR                         636
#define ULPWDIS                       637
#define DSCONH                        638
#define RTCWDIS                       639
#define DSULPEN                       640
#define DSEN                          641
#define DSGPR0                        642
#define DSGPR1                        643
#define CCPTMRS2                      644
#define C8TSEL0                       645
#define C8TSEL                        646
#define C8TSEL1                       647
#define C9TSEL0                       648
#define C10TSEL0                      649
#define CCPTMRS1                      650
#define C4TSEL                        651
#define C4TSEL0                       652
#define C4TSEL1                       653
#define C5TSEL0                       654
#define C6TSEL0                       655
#define C7TSEL                        656
#define C7TSEL0                       657
#define C7TSEL1                       658
#define CCPTMRS0                      659
#define C1TSEL0                       660
#define C1TSEL                        661
#define C1TSEL1                       662
#define C1TSEL2                       663
#define C2TSEL0                       664
#define C2TSEL                        665
#define C2TSEL1                       666
#define C2TSEL2                       667
#define C3TSEL0                       668
#define C3TSEL                        669
#define C3TSEL1                       670
#define CVRCON                        671
#define CVR                           672
#define CVR0                          673
#define CVR1                          674
#define CVR2                          675
#define CVR3                          676
#define CVRSS                         677
#define CVRR                          678
#define CVROEN                        679
#define CVROE                         680
#define CVREN                         681
#define UFRML                         682
#define FRML                          683
#define FRM0                          684
#define UFRML_FRM                     685
#define FRM1                          686
#define FRM2                          687
#define FRM3                          688
#define FRM4                          689
#define FRM5                          690
#define FRM6                          691
#define FRM7                          692
#define UFRMH                         693
#define FRM8                          694
#define UFRMH_FRM                     695
#define FRM9                          696
#define FRM10                         697
#define UIR                           698
#define URSTIF                        699
#define UERRIF                        700
#define ACTVIF                        701
#define TRNIF                         702
#define IDLEIF                        703
#define STALLIF                       704
#define SOFIF                         705
#define UEIR                          706
#define PIDEF                         707
#define CRC5EF                        708
#define CRC16EF                       709
#define DFN8EF                        710
#define BTOEF                         711
#define BTSEF                         712
#define USTAT                         713
#define PPBI                          714
#define DIR                           715
#define ENDP                          716
#define ENDP0                         717
#define ENDP1                         718
#define ENDP2                         719
#define ENDP3                         720
#define UCON                          721
#define SUSPND                        722
#define RESUME                        723
#define USBEN                         724
#define PKTDIS                        725
#define SE0                           726
#define PPBRST                        727
#define DMABCH                        728
#define DMACNTHB                      729
#define DMABCL                        730
#define DMACNTLB                      731
#define RXADDRH                       732
#define DMARCVPTRHB                   733
#define RXADDRL                       734
#define DMARCVPTRLB                   735
#define TXADDRH                       736
#define DMATXPTRHB                    737
#define TXADDRL                       738
#define DMATXPTRLB                    739
#define CMSTAT                        740
#define COUT1                         741
#define COUT2                         742
#define COUT3                         743
#define SSP2CON2                      744
#define SEN2                          745
#define SSP2CON2_SEN                  746
#define ADMSK12                       747
#define SSP2CON2_RSEN                 748
#define RSEN2                         749
#define SSP2CON2_ADMSK1               750
#define ADMSK22                       751
#define PEN2                          752
#define SSP2CON2_PEN                  753
#define SSP2CON2_ADMSK2               754
#define ADMSK32                       755
#define SSP2CON2_RCEN                 756
#define RCEN2                         757
#define SSP2CON2_ADMSK3               758
#define ACKEN2                        759
#define ADMSK42                       760
#define SSP2CON2_ADMSK4               761
#define SSP2CON2_ACKEN                762
#define ACKDT2                        763
#define ADMSK52                       764
#define SSP2CON2_ACKDT                765
#define SSP2CON2_ADMSK5               766
#define SSP2CON2_ACKSTAT              767
#define ACKSTAT2                      768
#define SSP2CON2_GCEN                 769
#define GCEN2                         770
#define SSP2CON1                      771
#define SSP2CON1_SSPM                 772
#define SSP2CON1_SSPM0                773
#define SSPM02                        774
#define SSPM12                        775
#define SSP2CON1_SSPM1                776
#define SSP2CON1_SSPM2                777
#define SSPM22                        778
#define SSPM32                        779
#define SSP2CON1_SSPM3                780
#define SSP2CON1_CKP                  781
#define CKP2                          782
#define SSPEN2                        783
#define SSP2CON1_SSPEN                784
#define SSPOV2                        785
#define SSP2CON1_SSPOV                786
#define WCOL2                         787
#define SSP2CON1_WCOL                 788
#define SSP2STAT                      789
#define SSP2STAT_BF                   790
#define BF2                           791
#define SSP2STAT_UA                   792
#define UA2                           793
#define RW2                           794
#define READ_WRITE2                   795
#define nW2                           796
#define I2C_READ2                     797
#define SSP2STAT_R_NOT_W              798
#define R_nW2                         799
#define nWRITE2                       800
#define R_W2                          801
#define SSP2STAT_R_nW                 802
#define SSP2STAT_S                    803
#define S2                            804
#define START2                        805
#define I2C_START2                    806
#define P2                            807
#define SSP2STAT_P                    808
#define STOP2                         809
#define I2C_STOP2                     810
#define I2C_DAT2                      811
#define DATA_ADDRESS2                 812
#define SSP2STAT_D_NOT_A              813
#define D_A2                          814
#define SSP2STAT_D_nA                 815
#define nA2                           816
#define DA2                           817
#define nADDRESS2                     818
#define D_nA2                         819
#define SSP2STAT_CKE                  820
#define CKE2                          821
#define SSP2STAT_SMP                  822
#define SMP2                          823
#define SSP2ADD                       824
#define MSK02                         825
#define SSP2ADD_SSPADD                826
#define MSK12                         827
#define MSK22                         828
#define MSK32                         829
#define MSK42                         830
#define MSK52                         831
#define MSK62                         832
#define MSK72                         833
#define SSP2MSK                       834
#define SSP2MSK_MSK0                  835
#define SSP2MSK_MSK1                  836
#define SSP2MSK_MSK2                  837
#define SSP2MSK_MSK3                  838
#define SSP2MSK_MSK4                  839
#define SSP2MSK_MSK5                  840
#define SSP2MSK_MSK6                  841
#define SSP2MSK_MSK7                  842
#define SSP2BUF                       843
#define SSP2BUF_SSPBUF                844
#define T4CON                         845
#define T4CKPS0                       846
#define T4CKPS                        847
#define T4CKPS1                       848
#define TMR4ON                        849
#define T4OUTPS                       850
#define T4OUTPS0                      851
#define T4OUTPS1                      852
#define T4OUTPS2                      853
#define T4OUTPS3                      854
#define PR4                           855
#define TMR4                          856
#define T3CON                         857
#define TMR3ON                        858
#define T3CON_RD16                    859
#define nT3SYNC                       860
#define NOT_T3SYNC                    861
#define SOSCEN3                       862
#define T3OSCEN                       863
#define T3CKPS                        864
#define T3CKPS0                       865
#define T3CKPS1                       866
#define TMR3CS0                       867
#define TMR3CS                        868
#define TMR3CS1                       869
#define T3RD16                        870
#define RD163                         871
#define TMR3L                         872
#define TMR3H                         873
#define BAUDCON2                      874
#define ABDEN2                        875
#define BAUDCON2_ABDEN                876
#define WUE2                          877
#define BAUDCON2_WUE                  878
#define BRG162                        879
#define BAUDCON2_BRG16                880
#define SCKP2                         881
#define TXCKP2                        882
#define BAUDCON2_TXCKP                883
#define DTRXP2                        884
#define RXDTP2                        885
#define BAUDCON2_RXDTP                886
#define RCMT2                         887
#define RCIDL2                        888
#define BAUDCON2_RCIDL                889
#define BAUDCON2_ABDOVF               890
#define ABDOVF2                       891
#define SPBRGH2                       892
#define BAUDCON1                      893
#define BAUDCON1_ABDEN                894
#define ABDEN1                        895
#define BAUDCON1_WUE                  896
#define WUE1                          897
#define W4E                           898
#define BRG161                        899
#define BAUDCON1_BRG16                900
#define CKTXP                         901
#define BAUDCON1_TXCKP                902
#define SCKP1                         903
#define TXCKP1                        904
#define SCKP                          905
#define DTRXP1                        906
#define RXDTP1                        907
#define DTRXP                         908
#define RXCKP                         909
#define BAUDCON1_RXDTP                910
#define RCMT1                         911
#define RCIDL1                        912
#define BAUDCON1_RCIDL                913
#define RCMT                          914
#define ABDOVF1                       915
#define BAUDCON1_ABDOVF               916
#define SPBRGH1                       917
#define PORTA                         918
#define C1INA                         919
#define AN0                           920
#define ULPWUIN                       921
#define ULPWU                         922
#define RP0                           923
#define RA0                           924
#define VBG                           925
#define AN1                           926
#define RP1                           927
#define RA1                           928
#define C2INA                         929
#define C1IND                         930
#define AN2                           931
#define C3INB                         932
#define CVREF                         933
#define RA2                           934
#define VREF_MINUS                    935
#define C2INB                         936
#define C1INB                         937
#define AN3                           938
#define VREF_PLUS                     939
#define RA3                           940
#define RCV                           941
#define AN4                           942
#define C1INC                         943
#define NOT_SS1                       944
#define RP2                           945
#define LVDIN                         946
#define RA5                           947
#define nSS1                          948
#define HLVDIN                        949
#define CLKO                          950
#define RA6                           951
#define OSC2                          952
#define CLKI                          953
#define RJPU                          954
#define RA7                           955
#define OSC1                          956
#define PORTB                         957
#define RB0                           958
#define C3IND                         959
#define INT0                          960
#define RP3                           961
#define AN12                          962
#define RB1                           963
#define C3INC                         964
#define RP4                           965
#define RTCC                          966
#define AN10                          967
#define REFO                          968
#define AN8                           969
#define RB2                           970
#define C2INC                         971
#define RP5                           972
#define VMO                           973
#define CTED1                         974
#define RP6                           975
#define AN9                           976
#define RB3                           977
#define VPO                           978
#define C3INA                         979
#define CCP2_PA2                      980
#define CTED2                         981
#define SCK1                          982
#define CCP4                          983
#define RB4                           984
#define RP7                           985
#define SCL1                          986
#define KBI0                          987
#define SDA1                          988
#define CCP5                          989
#define RB5                           990
#define RP8                           991
#define SDI1                          992
#define KBI1                          993
#define CCP6                          994
#define PGC                           995
#define RB6                           996
#define RP9                           997
#define KBI2                          998
#define CCP7                          999
#define PGD                           1000
#define RB7                           1001
#define RP10                          1002
#define KBI3                          1003
#define PORTC                         1004
#define T1CKI                         1005
#define RP11                          1006
#define T1OSO                         1007
#define RC0                           1008
#define CCP8                          1009
#define CCP2                          1010
#define NOT_UOE                       1011
#define nUOE                          1012
#define RP12                          1013
#define T1OSI                         1014
#define PA2                           1015
#define RC1                           1016
#define RP13                          1017
#define CTPLS                         1018
#define PA1                           1019
#define RC2                           1020
#define C2IND                         1021
#define AN11                          1022
#define D_MINUS                       1023
#define VM                            1024
#define RC4                           1025
#define D_PLUS                        1026
#define VP                            1027
#define RC5                           1028
#define CCP9                          1029
#define RP17                          1030
#define TX1                           1031
#define RC6                           1032
#define CK1                           1033
#define CCP10                         1034
#define SDO1                          1035
#define RP18                          1036
#define RX1                           1037
#define RC7                           1038
#define DT1                           1039
#define HLVDCON                       1040
#define HLVDL                         1041
#define HLVDL0                        1042
#define HLVDL1                        1043
#define HLVDL2                        1044
#define HLVDL3                        1045
#define HLVDEN                        1046
#define IRVST                         1047
#define BGVST                         1048
#define VDIRMAG                       1049
#define DMACON2                       1050
#define INTLVL0                       1051
#define INTLVL                        1052
#define INTLVL1                       1053
#define INTLVL2                       1054
#define INTLVL3                       1055
#define DLYCYC                        1056
#define DLYCYC0                       1057
#define DLYCYC1                       1058
#define DLYCYC2                       1059
#define DLYCYC3                       1060
#define OSCCON2                       1061
#define PRISD                         1062
#define SOSCGO                        1063
#define SOSCDRV                       1064
#define SOSCRUN                       1065
#define DMACON1                       1066
#define DMAEN                         1067
#define DLYINTEN                      1068
#define DUPLEX0                       1069
#define DUPLEX1                       1070
#define RXINC                         1071
#define TXINC                         1072
#define SSCON0                        1073
#define SSCON1                        1074
#define LATA                          1075
#define LATA0                         1076
#define LA0                           1077
#define LATA1                         1078
#define LA1                           1079
#define LATA2                         1080
#define LA2                           1081
#define LATA3                         1082
#define LA3                           1083
#define LATA5                         1084
#define LA5                           1085
#define LATA6                         1086
#define LA6                           1087
#define LATA7                         1088
#define LA7                           1089
#define LATB                          1090
